#define _USE_MATH_DEFINES
#include <iostream>
#include <cmath> //ใช้เรียกฟังชันก์ math tan() และ M_PI
using namespace std;

int main(){
    double a,b,c,d,e;
    a = M_PI*M_PI;
    b = 1; // tan(45)คือถ้าเขียนใน code มันจะได้ 1.6198 ซึ่งมันไม่ใช่สิ่งที่ควรเป็น สิ่งที่ควรคือ 1
    c = pow(4.3,2.0/7.0);
    d = pow(11.0,1.0/3.0);
    e = (8*7*6*5*4*3*2*1)/(pow(3,4)*pow(2,3));
    cout << (a-(b*c))/(d+e);
    return 0;
}

//สิ่งที่พลาด
//1.คือ ลำดับการคำนวณโค้ด วิธีแก้คือ แยกเป็นขึ้น
//2.คือ การ pow() เราควรใส่ .0 หลังเลขเพราะ ถ้าเราใส่แค่ เช่น 2 มันจะไม่มองเป็น double แต่จะมองเห็น int ซึ่งทำให้การคำนวณมันเพื้ยน วิธีแก้คือ ใส่ .0 หลังเลข เช่น 2.0
//3.คือ tan() เหมือนข้อนี้มันจะเป็น tan(45) ถ้าเขียนตรงๆ มันจะมองเป็น เรเดียน ทำให้ค่าที่ออกมามันจะเป็น 1.6198 ไม่ใช่ 1 ที่มันควรจะเป็น วิธีแก้ คือ ใส่ 1 ตรงๆ 56565